{
  "Home": "الرئيسية",
  "About": "من أنا",
  "Projects": "المشاريع",
  "Contact": "تواصل",
  "Testimonials" :"أراء العملاء",
  "Port": "بورت",
  "folio": "فوليو",
  "YourName": "حسن أحمد محمد",
  "JobTitle": "مطور واجهات أمامية",
  "Skills": "المهارات",
    "ContactUs": "تواصل معنا",
  "View Details": "عرض التفاصيل",
  "langCode": "ar",
  "Back To Home": "العودة إلى الرئيسية",
  "TechnologiesUsed": "التقنيات المستخدمة",
  "Loading": "جار التحميل...",
  "contact": {
    "title": "تواصل معنا",
    "name": "الاسم",
    "email": "البريد الإلكتروني",
    "message": "الرسالة",
    "send": "إرسال",
    "success": "تم إرسال رسالتك بنجاح!",
    "error": "حدث خطأ. يرجى المحاولة مرة أخرى لاحقًا."
  },
    "AboutMe": "عني",
    "AboutDescription": "أنا مطور واجهات أمامية (Front-End Developer) محترف، أمتلك خبرة تمتد لأكثر من سنتين في تصميم وتطوير واجهات مستخدم حديثة وتفاعلية باستخدام أحدث تقنيات الويب. أتمتع بمهارات قوية في:\n\nHTML, CSS, JavaScript لبناء هيكل وتنسيق مواقع متجاوبة.\n\nBootstrap وTailwind CSS لتصميم واجهات أنيقة وسريعة الاستجابة تدعم مختلف الأجهزة والشاشات.\n\nReact.js لتطوير تطبيقات ويب ديناميكية وقابلة للتوسع، مع خبرة في إدارة الحالة باستخدام Context API وRedux.\n\nكما أُتقن استخدام أدوات التحكم في الإصدارات مثل Git وGitHub للعمل ضمن فرق وتنظيم الكود بطريقة احترافية.\n\nلدي خبرة واسعة في التكامل مع واجهات برمجة التطبيقات (APIs) لربط الواجهة الأمامية بالأنظمة الخلفية، مما يمكنني من بناء تطبيقات متكاملة وسلسة الاستخدام. كما أضع دائمًا في اعتباري تحسين الأداء، سرعة التحميل، وتجربة المستخدم، لضمان توافق المواقع عبر مختلف المتصفحات.\n\nأهتم بتطبيق أفضل معايير تصميم تجربة المستخدم (UX) وواجهة المستخدم (UI)، وأسعى باستمرار لتعلُّم التقنيات الحديثة وتطوير مهاراتي لتقديم مشاريع مبتكرة ذات جودة عالية تلبي طموحات العملاء وتتجاوز توقعاتهم.",
    "Experience": "الخبرة",
    "Years": "سنوات",
    "ManyProjects": "عدد كبير من المشاريع المنجزة في مجالات متعددة (تجارية، تعليمية، شخصية)",
    "CurrentFocus": "التركيز الحالي",
    "ReactApps": "بناء تطبيقات React متجاوبة وسريعة",
    "DownloadCv": "تحميل السيرة الذاتية"
  ,
  "testimonials": {
  "title": "آراء العملاء",
  "items": [
    {
      "image": "/anas.jpg",
      "name": "أنس فوزي",
      "job": "صاحب معمل ماجيك لتراكيب الأسنان",
      "review": "تعاملي مع المهندس حسن كان تجربة مريحة وناجحة من البداية للنهاية. فهم طبيعة مجالنا بسرعة، وقدر يترجم احتياجاتنا لنظام إلكتروني عملي وسهل الاستخدام.\n\nالموقع اتنفذ بشكل منظم وواضح، وساعدنا في عرض خدماتنا بطريقة احترافية، بالإضافة إلى سرعة الأداء وسهولة التصفح على الموبايل والكمبيوتر.\n\nأكثر ما ميّز التعاون هو المتابعة المستمرة، والاهتمام بالتفاصيل الصغيرة، والاستجابة السريعة لأي تعديل أو تطوير مطلوب.\n\nبصراحة، شغل يعتمد عليه، وأنصح به لأي حد محتاج موقع يخدم شغله بشكل فعلي واحترافي."
    }
    ,{
      "image": "/mysra.jpg",
      "name": "ميسرة هاني",
      "job": "صاحب شركة ريآن للاستشارات الزراعية",
      "review": "تشرفت بالتعاون مع المهندس حسن في تصميم وتنفيذ الموقع الإلكتروني الخاص بشركتنا، والحقيقة التجربة كانت ممتازة على جميع المستويات.\n\nمن الناحية البرمجية، العمل كان احترافي جدًا، الموقع سريع، منظم، ومتجاوب مع جميع الشاشات، وتم تنفيذ كل المتطلبات بدقة، مع ربط الموقع بالداشبورد وقاعدة البيانات بشكل سلس وعملي.\n\nأما من حيث التعامل، فكان في التزام كامل بالمواعيد، مرونة في التعديلات، واستيعاب سريع لأي ملاحظات أو أفكار جديدة، مع اقتراح حلول تقنية مناسبة تخدم طبيعة عمل الشركة.\n\nأنصح بالتعامل معه لأي مشروع ويب يحتاج جودة، تنظيم، واهتمام بالتفاصيل."
    }
  ]
}

}


  


